In [3]:
import pandas as pd
from pathlib import Path
import json
import numpy as np
import re
import psycopg2
from sqlalchemy import create_engine
from config import db_password
import time

In [4]:
df = pd.read_csv(Path("CSV/Motor_Vehicle_Collisions_-_Crashes.csv"))

/Users/Yuyu/opt/anaconda3/envs/mlenv/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3457: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [5]:
df.head()

,CRASH DATE,CRASH TIME,BOROUGH,ZIP CODE,LATITUDE,LONGITUDE,LOCATION,ON STREET NAME,CROSS STREET NAME,OFF STREET NAME,...,CONTRIBUTING FACTOR VEHICLE 2,CONTRIBUTING FACTOR VEHICLE 3,CONTRIBUTING FACTOR VEHICLE 4,CONTRIBUTING FACTOR VEHICLE 5,COLLISION_ID,VEHICLE TYPE CODE 1,VEHICLE TYPE CODE 2,VEHICLE TYPE CODE 3,VEHICLE TYPE CODE 4,VEHICLE TYPE CODE 5
0,09/11/2021,2:39,NaN,NaN,NaN,NaN,NaN,WHITESTONE EXPRESSWAY,20 AVENUE,NaN,...,Unspecified,NaN,NaN,NaN,4455765,Sedan,Sedan,NaN,NaN,NaN
1,03/26/2022,11:45,NaN,NaN,NaN,NaN,NaN,QUEENSBORO BRIDGE UPPER,NaN,NaN,...,NaN,NaN,NaN,NaN,4513547,Sedan,NaN,NaN,NaN,NaN
2,06/29/2022,6:55,NaN,NaN,NaN,NaN,NaN,THROGS NECK BRIDGE,NaN,NaN,...,Unspecified,NaN,NaN,NaN,4541903,Sedan,Pick-up Truck,NaN,NaN,NaN
3,09/11/2021,9:35,BROOKLYN,11208.0,40.667202,-73.866500,"(40.667202, -73.8665)",NaN,NaN,1211 LORING AVENUE,...,NaN,NaN,NaN,NaN,4456314,Sedan,NaN,NaN,NaN,NaN
4,12/14/2021,8:13,BROOKLYN,11233.0,40.683304,-73.917274,"(40.683304, -73.917274)",SARATOGA AVENUE,DECATUR STREET,NaN,...,NaN,NaN,NaN,NaN,4486609,NaN,NaN,NaN,NaN,NaN

In [6]:
print(df.columns)

Index(['CRASH DATE', 'CRASH TIME', 'BOROUGH', 'ZIP CODE', 'LATITUDE',
       'LONGITUDE', 'LOCATION', 'ON STREET NAME', 'CROSS STREET NAME',
       'OFF STREET NAME', 'NUMBER OF PERSONS INJURED',
       'NUMBER OF PERSONS KILLED', 'NUMBER OF PEDESTRIANS INJURED',
       'NUMBER OF PEDESTRIANS KILLED', 'NUMBER OF CYCLIST INJURED',
       'NUMBER OF CYCLIST KILLED', 'NUMBER OF MOTORIST INJURED',
       'NUMBER OF MOTORIST KILLED', 'CONTRIBUTING FACTOR VEHICLE 1',
       'CONTRIBUTING FACTOR VEHICLE 2', 'CONTRIBUTING FACTOR VEHICLE 3',
       'CONTRIBUTING FACTOR VEHICLE 4', 'CONTRIBUTING FACTOR VEHICLE 5',
       'COLLISION_ID', 'VEHICLE TYPE CODE 1', 'VEHICLE TYPE CODE 2',
       'VEHICLE TYPE CODE 3', 'VEHICLE TYPE CODE 4', 'VEHICLE TYPE CODE 5'],
      dtype='object')

In [13]:
collision_df = df.drop(columns = ['CRASH DATE', 'CRASH TIME', 'BOROUGH', 'ZIP CODE', 'LATITUDE',
       'LONGITUDE', 'LOCATION', 'ON STREET NAME', 'CROSS STREET NAME',
       'OFF STREET NAME','NUMBER OF PEDESTRIANS INJURED','NUMBER OF PEDESTRIANS KILLED', 'NUMBER OF CYCLIST INJURED',
       'NUMBER OF CYCLIST KILLED', 'NUMBER OF MOTORIST INJURED',
       'NUMBER OF MOTORIST KILLED', 'CONTRIBUTING FACTOR VEHICLE 1',
       'CONTRIBUTING FACTOR VEHICLE 2', 'CONTRIBUTING FACTOR VEHICLE 3',
       'CONTRIBUTING FACTOR VEHICLE 4', 'CONTRIBUTING FACTOR VEHICLE 5','VEHICLE TYPE CODE 1', 'VEHICLE TYPE CODE 2',
       'VEHICLE TYPE CODE 3', 'VEHICLE TYPE CODE 4', 'VEHICLE TYPE CODE 5'])
collision_df.head()

   NUMBER OF PERSONS INJURED  NUMBER OF PERSONS KILLED  COLLISION_ID
0                        2.0                       0.0       4455765
1                        1.0                       0.0       4513547
2                        0.0                       0.0       4541903
3                        0.0                       0.0       4456314
4                        0.0                       0.0       4486609

In [14]:
collision_df.isnull().sum()

NUMBER OF PERSONS INJURED    18
NUMBER OF PERSONS KILLED     31
COLLISION_ID                  0
dtype: int64

In [15]:
collision_df.dtypes

NUMBER OF PERSONS INJURED    float64
NUMBER OF PERSONS KILLED     float64
COLLISION_ID                   int64
dtype: object

In [16]:
clean_collision_df = collision_df.dropna()

clean_collision_df.head()

   NUMBER OF PERSONS INJURED  NUMBER OF PERSONS KILLED  COLLISION_ID
0                        2.0                       0.0       4455765
1                        1.0                       0.0       4513547
2                        0.0                       0.0       4541903
3                        0.0                       0.0       4456314
4                        0.0                       0.0       4486609

In [17]:
clean_collision_df.isnull().sum()

NUMBER OF PERSONS INJURED    0
NUMBER OF PERSONS KILLED     0
COLLISION_ID                 0
dtype: int64

In [18]:
output_file_path = 'CSV\Collisions.csv'
clean_collision_df.to_csv(output_file_path, index=False)

In [19]:
location_df = df.drop(columns = ['CRASH DATE', 'CRASH TIME','LATITUDE',
       'LONGITUDE', 'LOCATION', 'ON STREET NAME', 'CROSS STREET NAME',
       'OFF STREET NAME', 'NUMBER OF PERSONS INJURED',
       'NUMBER OF PERSONS KILLED', 'NUMBER OF PEDESTRIANS INJURED',
       'NUMBER OF PEDESTRIANS KILLED', 'NUMBER OF CYCLIST INJURED',
       'NUMBER OF CYCLIST KILLED', 'NUMBER OF MOTORIST INJURED',
       'NUMBER OF MOTORIST KILLED', 'CONTRIBUTING FACTOR VEHICLE 1',
       'CONTRIBUTING FACTOR VEHICLE 2', 'CONTRIBUTING FACTOR VEHICLE 3',
       'CONTRIBUTING FACTOR VEHICLE 4', 'CONTRIBUTING FACTOR VEHICLE 5', 'VEHICLE TYPE CODE 1', 'VEHICLE TYPE CODE 2',
       'VEHICLE TYPE CODE 3', 'VEHICLE TYPE CODE 4', 'VEHICLE TYPE CODE 5'])

location_df.head()

    BOROUGH ZIP CODE  COLLISION_ID
0       NaN      NaN       4455765
1       NaN      NaN       4513547
2       NaN      NaN       4541903
3  BROOKLYN  11208.0       4456314
4  BROOKLYN  11233.0       4486609

In [20]:
location_df.isnull().sum()

BOROUGH         600984
ZIP CODE        601218
COLLISION_ID         0
dtype: int64

In [21]:
location_df.dtypes

BOROUGH         object
ZIP CODE        object
COLLISION_ID     int64
dtype: object

In [22]:
location_df.drop(location_df.loc[location_df['ZIP CODE']=='     '].index, inplace=True)

In [23]:
clean_location_df = location_df.dropna()

clean_location_df.head()

     BOROUGH ZIP CODE  COLLISION_ID
3   BROOKLYN  11208.0       4456314
4   BROOKLYN  11233.0       4486609
7      BRONX  10475.0       4486660
8   BROOKLYN  11207.0       4487074
9  MANHATTAN  10017.0       4486519

In [24]:
clean_location_df.isnull().sum()

BOROUGH         0
ZIP CODE        0
COLLISION_ID    0
dtype: int64

In [25]:
output_file_path = 'CSV\Locations.csv'
clean_location_df.to_csv(output_file_path, index=False)

In [26]:
date_time_df = df.drop(columns = ['BOROUGH', 'ZIP CODE', 'LATITUDE',
       'LONGITUDE', 'LOCATION', 'ON STREET NAME', 'CROSS STREET NAME',
       'OFF STREET NAME', 'NUMBER OF PERSONS INJURED',
       'NUMBER OF PERSONS KILLED', 'NUMBER OF PEDESTRIANS INJURED',
       'NUMBER OF PEDESTRIANS KILLED', 'NUMBER OF CYCLIST INJURED',
       'NUMBER OF CYCLIST KILLED', 'NUMBER OF MOTORIST INJURED',
       'NUMBER OF MOTORIST KILLED', 'CONTRIBUTING FACTOR VEHICLE 1',
       'CONTRIBUTING FACTOR VEHICLE 2', 'CONTRIBUTING FACTOR VEHICLE 3',
       'CONTRIBUTING FACTOR VEHICLE 4', 'CONTRIBUTING FACTOR VEHICLE 5','VEHICLE TYPE CODE 1', 'VEHICLE TYPE CODE 2',
       'VEHICLE TYPE CODE 3', 'VEHICLE TYPE CODE 4', 'VEHICLE TYPE CODE 5'])

date_time_df.head()

   CRASH DATE CRASH TIME  COLLISION_ID
0  09/11/2021       2:39       4455765
1  03/26/2022      11:45       4513547
2  06/29/2022       6:55       4541903
3  09/11/2021       9:35       4456314
4  12/14/2021       8:13       4486609

In [27]:
date_time_df.isnull().sum()

CRASH DATE      0
CRASH TIME      0
COLLISION_ID    0
dtype: int64

In [28]:
date_time_df.dtypes

CRASH DATE      object
CRASH TIME      object
COLLISION_ID     int64
dtype: object

In [29]:
date_time_df["CRASH DATE"] = pd.to_datetime(date_time_df['CRASH DATE'])

In [30]:
date_time_df.dtypes

CRASH DATE      datetime64[ns]
CRASH TIME              object
COLLISION_ID             int64
dtype: object

In [31]:
clean_date_time_df = date_time_df

clean_date_time_df.head()

  CRASH DATE CRASH TIME  COLLISION_ID
0 2021-09-11       2:39       4455765
1 2022-03-26      11:45       4513547
2 2022-06-29       6:55       4541903
3 2021-09-11       9:35       4456314
4 2021-12-14       8:13       4486609

In [32]:
output_file_path = 'CSV\Date_Time.csv'
clean_date_time_df.to_csv(output_file_path, index=False)

In [33]:
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/NYC_Vehicle_Collision_Prediction"
engine = create_engine(db_string)
file_dir = '/Users/Yuyu/Desktop/Bootcamp/Module20/NYC_Vehicle_Collision_Prediction/CSV'

In [34]:
rows_imported = 0
for data in pd.read_csv(f'{file_dir}\\Collisions.csv', chunksize=100000):
    print(f'importing rows {rows_imported} to {rows_imported + len(data)}...', end='')
    data.to_sql(name='collisions', con=engine, if_exists='append')
    rows_imported += len(data)
    print('Done.')

importing rows 0 to 100000...Done.
importing rows 100000 to 200000...Done.
importing rows 200000 to 300000...Done.
importing rows 300000 to 400000...Done.
importing rows 400000 to 500000...Done.
importing rows 500000 to 600000...Done.
importing rows 600000 to 700000...Done.
importing rows 700000 to 800000...Done.
importing rows 800000 to 900000...Done.
importing rows 900000 to 1000000...Done.
importing rows 1000000 to 1100000...Done.
importing rows 1100000 to 1200000...Done.
importing rows 1200000 to 1300000...Done.
importing rows 1300000 to 1400000...Done.
importing rows 1400000 to 1500000...Done.
importing rows 1500000 to 1600000...Done.
importing rows 1600000 to 1700000...Done.
importing rows 1700000 to 1800000...Done.
importing rows 1800000 to 1900000...Done.
importing rows 1900000 to 1936668...Done.

In [35]:
rows_imported = 0
for data in pd.read_csv(f'{file_dir}\\Locations.csv', chunksize=100000):
    print(f'importing rows {rows_imported} to {rows_imported + len(data)}...', end='')
    data.to_sql(name='locations', con=engine, if_exists='append')
    rows_imported += len(data)
    print('Done.')

importing rows 0 to 100000...Done.
importing rows 100000 to 200000...Done.
importing rows 200000 to 300000...Done.
importing rows 300000 to 400000...Done.
importing rows 400000 to 500000...Done.
importing rows 500000 to 600000...Done.
importing rows 600000 to 700000...Done.
importing rows 700000 to 800000...Done.
importing rows 800000 to 900000...Done.
importing rows 900000 to 1000000...Done.
importing rows 1000000 to 1100000...Done.
importing rows 1100000 to 1200000...Done.
importing rows 1200000 to 1300000...Done.
importing rows 1300000 to 1335445...Done.

In [36]:
rows_imported = 0
for data in pd.read_csv(f'{file_dir}\\Date_Time.csv', chunksize=100000):
    print(f'importing rows {rows_imported} to {rows_imported + len(data)}...', end='')
    data.to_sql(name='date_time', con=engine, if_exists='append')
    rows_imported += len(data)
    print('Done.')

importing rows 0 to 100000...Done.
importing rows 100000 to 200000...Done.
importing rows 200000 to 300000...Done.
importing rows 300000 to 400000...Done.
importing rows 400000 to 500000...Done.
importing rows 500000 to 600000...Done.
importing rows 600000 to 700000...Done.
importing rows 700000 to 800000...Done.
importing rows 800000 to 900000...Done.
importing rows 900000 to 1000000...Done.
importing rows 1000000 to 1100000...Done.
importing rows 1100000 to 1200000...Done.
importing rows 1200000 to 1300000...Done.
importing rows 1300000 to 1400000...Done.
importing rows 1400000 to 1500000...Done.
importing rows 1500000 to 1600000...Done.
importing rows 1600000 to 1700000...Done.
importing rows 1700000 to 1800000...Done.
importing rows 1800000 to 1900000...Done.
importing rows 1900000 to 1936705...Done.